Catalogs/КурсыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КурсыОбучения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьКурса</Name>
					<Comment>Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаОдногоОбучающегося</Name>
					<Comment>Средний размер затрат на обучение одного работника на данном курсе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаОбОбразовании</Name>
					<Comment>Вид выдаваемого документа после обучения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыОбОбразовании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВРегУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзучаемыеКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииРаботников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Comment>Вес изучения компетенции в курсе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗанятияКурса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Занятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗанятияКурсовОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КурсыОбучения/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Печать курса обучения
//  
// Параметры
//  Нет
//
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КурсОбучения";
	Макет = ПолучитьМакет("Макет");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(ВидДокументаОбОбразовании) тогда	
		ОбластьМакета.Параметры.ВидДокументаОбОбразовании = НСтр("ru='документы не выдаются';uk='документи не видаються'",КодЯзыкаПечать)
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// группа компектенций 
	ТабДокумент.НачатьГруппуСтрок("Компетенции",Истина);
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаСтрокКомпетенций"));
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКомпетенции");
	Для Каждого СтрокаТЧ из ИзучаемыеКомпетенции Цикл
		ОбластьМакета.Параметры.Компетенция  = СтрокаТЧ.Компетенция;
		ОбластьМакета.Параметры.Длительность = СтрокаТЧ.Вес * ДлительностьКурса / 100;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ТабДокумент.ЗакончитьГруппуСтрок();
	
	// группа форм обучения
	// Эти части имеет смысл выводить, если есть хотя бы одно занятие.
	Если ЗанятияКурса.Количество() > 0 Тогда
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("СоставПоФормеОбучения"));
		ТабДокумент.НачатьГруппуСтрок("Формы",Истина);	
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаСоставПоФормеОбучения"));
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Запрос.Текст =  
		"ВЫБРАТЬ
		|	СУММА(КурсыОбученияЗанятияКурса.Занятие.ДлительностьЗанятия) КАК Длительность,
		|	ЕСТЬNULL(КурсыОбученияЗанятияКурса.Занятие.ВидЗанятия.Наименование, """+НСтр("ru='форма обучения не указана';uk='форма навчання не зазначена'",КодЯзыкаПечать)+""") КАК ФормаОбучения
		|ИЗ
		|	Справочник.КурсыОбучения.ЗанятияКурса КАК КурсыОбученияЗанятияКурса
		|ГДЕ
		|	КурсыОбученияЗанятияКурса.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КурсыОбученияЗанятияКурса.Занятие.ВидЗанятия";
		
		ТабФормОбучения = Запрос.Выполнить().Выгрузить();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФормыОбучения");
		Для Каждого СтрокаТЧ из ТабФормОбучения Цикл
			ОбластьМакета.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		ТабДокумент.ЗакончитьГруппуСтрок();
		
		// занятия
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаЗанятия"));
		
		Запрос.Текст =  
		"ВЫБРАТЬ
		|	КурсыОбученияЗанятияКурса.Занятие.Наименование КАК Занятие,
		|	КурсыОбученияЗанятияКурса.Занятие.ДлительностьЗанятия КАК Длительность,
		|	ЕСТЬNULL(КурсыОбученияЗанятияКурса.Занятие.ВидЗанятия.Наименование, """+НСтр("ru='форма обучения не указана';uk='форма навчання не зазначена'",КодЯзыкаПечать)+""") КАК ФормаОбучения
		|ИЗ
		|	Справочник.КурсыОбучения.ЗанятияКурса КАК КурсыОбученияЗанятияКурса
		|ГДЕ
		|	КурсыОбученияЗанятияКурса.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КурсыОбученияЗанятияКурса.НомерСтроки";
		ТабЗанятияКурса = Запрос.Выполнить().Выгрузить();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗанятия");
		Для Каждого СтрокаТЧ из ТабЗанятияКурса Цикл
			ОбластьМакета.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(ОбластьМакета);    
		КонецЦикла;
		
	КонецЕсли; // Вывод если есть занятия
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент,,, "Данные по: " + Наименование);
	
КонецФункции

#КонецЕсли
